api-vs-graph/perf/scenarios/A-graphql-list.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 2000

scenarios:
  - name: GraphQL list 25 basic entries (no relations)
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: "{ basics(pagination: { pageSize: 25 }) { documentId stringField } }"
          expect:
            - statusCode: 200