api-vs-graph/perf/scenarios/B-graphql-populated.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: GraphQL list 25 relations with populated relations + component
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: "{ relations(pagination: { pageSize: 25 }) { documentId name oneToOneBasic { stringField } manyToManyBasics { stringField } simpleInfo { title } } }"
          expect:
            - statusCode: 200