api-vs-graph/perf/scenarios/B-rest-populated.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: REST list 25 relations with populated relations + component
    flow:
      - get:
          url: "/api/relations?pagination[pageSize]=25&populate[oneToOneBasic]=true&populate[manyToManyBasics]=true&populate[simpleInfo]=true"
          expect:
            - statusCode: 200