api-vs-graph/perf/scenarios/C-graphql-deep.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: GraphQL list 10 relations with deep selection (relations + components + DZ)
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: "{ relations(pagination: { pageSize: 10 }) { documentId name oneToOneBasic { stringField } manyToManyBasics { stringField } simpleInfo { title } textBlocks { id } mediaBlock { id } content { __typename ... on ComponentSharedSimpleInfo { title } ... on ComponentSharedImageBlock { id } } sections { __typename ... on ComponentSharedTextBlock { id } ... on ComponentSharedMediaBlock { id } } } }"
          expect:
            - statusCode: 200