api-vs-graph/perf/scenarios/C-rest-deep.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: REST list 10 relations with deep populate (relations + components + DZ)
    flow:
      - get:
          url: "/api/relations?pagination[pageSize]=10&populate[oneToOneBasic]=true&populate[manyToManyBasics]=true&populate[simpleInfo]=true&populate[textBlocks]=true&populate[mediaBlock]=true&populate[content][on][shared.simple-info][populate]=*&populate[content][on][shared.image-block][populate]=*&populate[sections][on][shared.text-block][populate]=*&populate[sections][on][shared.media-block][populate]=*"
          expect:
            - statusCode: 200