api-vs-graph/perf/scenarios/D-graphql-create.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: GraphQL create basic entry
    flow:
      - post:
          url: "/graphql"
          headers:
            Content-Type: "application/json"
          json:
            query: "mutation { createBasic(data: { stringField: \"perf-test-gql\", integerField: 42, booleanField: true }) { documentId } }"
          expect:
            - statusCode: 200