api-vs-graph/perf/scenarios/D-rest-create.yml
config:
  target: "http://localhost:1337"
  phases:
    - name: warmup
      duration: 10
      arrivalRate: 10
    - name: load
      duration: 60
      arrivalRate: 50
  http:
    timeout: 30
  ensure:
    p95: 5000

scenarios:
  - name: REST create basic entry
    flow:
      - post:
          url: "/api/basics"
          headers:
            Content-Type: "application/json"
          json:
            data:
              stringField: "perf-test"
              integerField: 42
              booleanField: true
          expect:
            - statusCode: [200, 201]